[
    {
        "position": "Restaurant Manager",
        "location": "The Fish Market Palo Alto, San Mateo, and San Diego",
        "description": "During my tenure as a Restaurant Manager at The Fish Market Restaurants, I played a multifaceted role in ensuring the success and growth of our establishment. I had the unique opportunity to work in five different locations, and in three of those locations, I took on the role of manager, while in the others, I provided valuable support as an employee.\n\nPalo Alto and San Mateo (Managerial Roles): Transitioning to Palo Alto and San Mateo, I assumed the responsibilities of a Restaurant Manager. In these roles, I led and inspired diverse teams, fostering a collaborative work environment that prioritized staff training and development. Through this approach, we witnessed tangible improvements in service quality and staff retention rates, all while consistently meeting the highest standards of quality and service. Our dedication to excellence contributed to the establishment's reputation for exceptional food and service in these competitive markets.\nSan Diego (Managerial Support): In San Diego, my managerial role was relatively brief, spanning just three weeks. However, even in this limited time, I applied my expertise to lead the team and maintain quality assurance. Despite the brevity of my tenure, I made sure to uphold the restaurant's high standards and contribute to its operational excellence during this period.\n\nThroughout my journey at The Fish Market Restaurants, whether in managerial or support roles, my commitment to operational excellence, safety, and staying ahead of sales trends remained unwavering. I am proud to have been a part of the team that contributed to the success and growth of our establishment in these diverse locations.",
        "skills": "Microsoft Word 路 Food & Beverage 路 People Management 路 Microsoft Office 路 Microsoft Excel",
        "time": "Dec 2021 - Present 路 1 yr 11 mos"
    },
    {
        "position": "Online Menu and Food Ordering Platforms Coordinator",
        "location": "The Fish Market Corporate Office",
        "description": "Demonstrated my proficiency in managing daily and scheduled menu updates on platforms such as DoorDash, UberEats, and GrubHub, as well as maintaining accuracy on our WordPress website. My responsibilities included monitoring daily changes such as price fluctuations, item availability, and seasonal adjustments, ensuring real-time updates. Additionally, I collaborated with Corporate/Management teams to schedule and execute price changes, new menu item roll-outs, and item discontinuations, following a strategic order of completion. This role required strong communication and coordination skills and a keen eye for detail in a fast-paced restaurant environment.",
        "skills": "WordPress 路 Menu Development 路 Microsoft Office",
        "time": "Dec 2022 - Sep 2023 路 10 mos"
    },
    {
        "position": "Talent Acquisition Recruiter",
        "location": "The Fish Market Corporate Office",
        "description": "In my role as a recruiter at The Fish Market Restaurants, I have had the privilege of identifying, attracting, and nurturing top talent to drive the success of our organization.\n\nKey Achievements and Responsibilities:\n Talent Acquisition: Developed and executed comprehensive recruitment strategies to source and engage high-caliber candidates across various roles. This included leveraging job boards.\n Performance Metrics: Consistently met and exceeded recruitment goals, playing a pivotal role in expanding our team and supporting company growth.\n Candidate Experience: Prioritized providing a positive candidate experience, ensuring seamless and respectful communication throughout the recruitment process.\n Talent Development: Collaborated with hiring managers and department heads to understand their needs and preferences, aligning recruitment efforts with the company's strategic objectives.\n Market Research: Conducted ongoing market research and analysis to stay updated on industry trends and competitor practices, allowing for informed decision-making and the adoption of best recruitment practices.\n Onboarding Support: Assisted in the development and improvement of onboarding processes to ensure a smooth transition for new hires, facilitating their integration into our organizational culture. In my role as a recruiter at The Fish Market Restaurants, I have had the privilege of identifying, attracting, and nurturing top talent to drive the success of our organization.",
        "skills": "Restaurant Recruiting 路 Microsoft Word 路 Recruiting 路 Spanish 路 Microsoft Office 路 Microsoft Excel",
        "time": "Jun 2022 - Jan 2023 路 8 mos"
    },
    {
        "position": "Retail Market",
        "location": "The Fish Market San Jose, Palo Alto",
        "description": "Experienced Seafood Clerk skilled in efficiently managing takeout orders, meticulously maintaining inventory, implementing rigorous portion control, and ensuring uncompromising safety and sanitization standards. Proficient in overseeing seafood and produce orders to maintain product freshness and quality. Adept at training and leading new staff members, imparting essential techniques, and fostering a culture of excellence in customer service and operations.",
        "skills": "Inventory Control 路 Employee Training 路 Microsoft Excel",
        "time": "Aug 2017 - Dec 2021 路 4 yrs 5 mos"
    }
]